Revit 2027 API
FlowTransitionCharacteristic Enumeration
 The flow transition characteristic of the analytical segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FlowTransitionCharacteristic
Public Enumeration FlowTransitionCharacteristic
public enum class FlowTransitionCharacteristic
type FlowTransitionCharacteristic
Members
Member name | Value | Description
Contraction | 2 |  The segment profile is contracting along the flow direction.
Expansion | 1 |  The segment profile is expanding along the flow direction.
Undefined | 0 |  The flow transition characteristic is undefined.
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace